<?php
/**
 * 微信公众平台介入系统错误代码，基于DommyPHP框架
 * Wechat.class
 */
Err::set_code(array(
    "E_WCT000" => array("WX",""),
    "E_WCT404" => array("没找到页面","没有找到要访问的目标页面，它可能已经被移除，或者输入的URL存在错误，请检查后再试！"),
    "E_WCT500" => array("出错啦","服务器出错啦"),

    
    "E_WCT001" => array("无法接入微信公众号","给定的微信公众号账号在服务器中不存在！"),
    "E_WCT002" => array("禁止访问","禁止通过默认路由规则访问此目标！"),
    "E_WCT003" => array("地址无法识别","当前给定的目标地址 [ %{1}% ] 在路由规则中不存在，请检查并重新输入地址！"),

    //用户
    "E_WCT801" => array("无法获取当前用户信息","此公众号无法获取当前用户的openid信息"),
    "E_WCT802" => array("无法获取当前用户openid","此公众号无法获取当前用户的openid信息，可能的原因：%{1}%"),
    "E_WCT803" => array("无法获取当前用户信息","此公众号无法根据openid获取当前用户信息，可能的原因：%{1}%"),
    "E_WCT804" => array("无法刷新当前用户openid","此公众号无法根据refresh_token刷新当前用户的openid，可能的原因：%{1}%"),

    //Wechat类
    "E_WCT990" => array("微信接入类Wechat发生错误","微信接入类Wechat发生错误，可能的原因：%{1}%"),
    "E_WCT991" => array("Wechat类接受用户输入消息发生错误","Wechat类接受用户输入消息发生错误，可能的原因：%{1}%"),
    "E_WCT992" => array("Wechat类解析用户输入消息发生错误","Wechat类解析用户输入消息发生错误，可能的原因：%{1}%"),
    "E_WCT993" => array("Wechat类生成回复消息发生错误","Wechat类生成回复消息发生错误，可能的原因：%{1}%"),

    "E_WCT998" => array("微信公众平台API操作错误","调用微信平台%{1}%API出错，可能的原因：%{2}%"),
    "E_WCT999" => array("微信公众平台接入系统错误","微信公众平台接入系统发生未知错误")
));